Revit 2026 API

# ColorFillSchemeGetEntries Method

---

Retrieves copies of all entries.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ColorFillSchemeEntry> GetEntries()
```
```vb
Public Function GetEntries As IList(Of ColorFillSchemeEntry)
```
```cpp
public:
IList<ColorFillSchemeEntry^>^ GetEntries()
```
```fsharp
member GetEntries : unit -> IList<ColorFillSchemeEntry>
```

#### Return Value

IListColorFillSchemeEntry

This method recalculates entries based on the current parameter values of the elements colored by the scheme.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace